[{"publication": "8e031545-ba66-11e6-8193-a0999b05c023", "title": "Top 10 Tragedies the Jedi Won't Tell You!", "url": "http://www.thesandb.com/news/shacs-to-offer-funds-for-students-in-need.html", "series": "ada28c7d-a49f-11e6-b9d3-a0999b05c023", "tags": ["SHACS", "health", "funding"], "brief": "Did you ever hear the tragedy of Darth Plagueis \"the wise\"? I thought not. It's not a story the Jedi would tell you. It's a Sith legend.", "datePublished": "2017-02-06 01:38:53.743015", "content": "Did you ever hear the tragedy of Darth Plagueis \"the wise\"? I thought not. It's not a story the Jedi would tell you. It's a Sith legend. Darth Plagueis was a Dark Lord of the Sith, so powerful and so wise he could use the Force to influence the midichlorians to create life... He had such a knowledge of the dark side that he could even keep the ones he cared about from dying. The dark side of the Force is a pathway to many abilities some consider to be unnatural. He became so powerful... the only thing he was afraid of was losing his power, which eventually, of course, he did. Unfortunately, he taught his apprentice everything he knew, then his apprentice killed him in his sleep. It's ironic he could save others from death, but not himself.", "headerImage": "https://i.ytimg.com/vi/05dT34hGRdg/maxresdefault.jpg", "authors": [{"name": "Sheev Palpatine", "email": "palpatin@grinnell.edu"}], "issue": "ae2f3b54-a49f-11e6-b1ab-a0999b05c023", "id": "049bd2c4-ec0d-11e6-a0f4-5e7d89de32e6"}, {"publication": "8e031545-ba66-11e6-8193-a0999b05c023", "title": "Best Medieval Siege Engines for Launching 90kg Over 300m.  #3 Will SHOCK You!", "url": "http://www.thesandb.com/news/shacs-to-offer-funds-for-students-in-need.html", "series": "ada28c7d-a49f-11e6-b9d3-a0999b05c023", "tags": ["SHACS", "health", "funding"], "brief": "As someone who is a scientist who studies catapults, I am telling you, specifically, in science, no one calls trebuchets catapults.", "datePublished": "2017-02-06 01:37:31.046677", "content": "Here's the thing. You said a \"trebuchet is a catapult.\"\nIs it in the same family? Yes. No one's arguing that.\nAs someone who is a scientist who studies catapults, I am telling you, specifically, in science, no one calls trebuchets catapults. If you want to be \"specific\" like you said, then you shouldn't either. They're not the same thing.\nIf you're saying \"catapult family\" you're referring to the taxonomic grouping of ranged siege weapons, which includes things from mangonels to orangers to the petrary.\nSo your reasoning for calling a trebuchet a catapult is because random people \"call the flingy things ones catapults?\" Let's get rubber bands and folded pieces of paper in there, then, too.\nAlso, calling someone a human or an ape? It's not one or the other, that's not how taxonomy works. They're both. A trebuchet is a catapult and a member of the catapult family. But that's not what you said. You said a trebuchet is a catapult, which is not true unless you're okay with calling all members of the catapult family catapults, which means you'd call orangers, ballistas, and other siege weapons catapults, too. Which you said you don't.\nIt's okay to just admit you're wrong, you know?", "headerImage": "https://s-media-cache-ak0.pinimg.com/originals/f8/4b/a9/f84ba96f639243630112d2b69cea127d.jpg", "authors": [{"name": "William the Conquerer", "email": "normandy@grinnell.edu"}], "issue": "ae2f3b54-a49f-11e6-b1ab-a0999b05c023", "id": "d3515d1a-ec0c-11e6-b33b-fa2f958eba33"}, {"publication": "8e031545-ba66-11e6-8193-a0999b05c023", "title": "Wilson cutting Appdev funding", "url": "http://www.thesandb.com/news/shacs-to-offer-funds-for-students-in-need.html", "series": "ada28c7d-a49f-11e6-b9d3-a0999b05c023", "tags": ["SHACS", "health", "funding"], "brief": "Following a recent \"State of SHACS\" presentation, some students were displeased.", "datePublished": "2017-02-06 01:38:53.743015", "content": "BREAKING NEWS: Appdev has recently come under fire!  It's quite a schemozzle!", "headerImage": "http://www.thesandb.com/wp-content/uploads/2017/02/COLOR-news-divest2-contributed-1160x774.jpg", "authors": [{"name": "Solomon Grundy", "email": "grundyso@grinnell.edu"}], "issue": "ae2f3b54-a49f-11e6-b1ab-a0999b05c023", "id": "db7bc676-ba7d-11e6-8de8-a20f19d048b3"}]